tap "homebrew/bundle"
tap "homebrew/services"
tap "peripheryapp/periphery"
brew "asdf"
brew "bat"
brew "binwalk"
brew "carthage"
brew "clang-format"
brew "cocoapods"
brew "curl"
brew "python@3.13"
brew "detect-secrets"
brew "docker"
brew "fastlane"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras", link: false
brew "git-flow"
brew "git-ignore"
brew "git-imerge"
brew "git-lfs"
brew "git-quick-stats"
brew "git-secrets"
brew "git-standup"
brew "gitleaks"
brew "gnupg"
brew "htop"
brew "httpie"
brew "ios-deploy"
brew "jq"
brew "kotlin"
brew "libffi"
brew "mas"
brew "ncdu"
brew "neovim"
brew "node"
brew "periphery", link: false
brew "plantuml"
brew "pre-commit"
brew "pyenv"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "rcm"
brew "ripgrep"
brew "shellcheck"
brew "sourcery"
brew "stow"
brew "swift-format"
brew "swiftformat"
brew "swiftlint"
brew "the_silver_searcher"
brew "tldr"
brew "utf8proc", args: ["HEAD"]
brew "tmux"
brew "tree"
brew "unzip"
brew "velero"
brew "watchman"
brew "wget"
brew "xcbeautify"
brew "xcinfo"
brew "xcode-build-server"
brew "xcodegen"
brew "yarn"
brew "zip"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "anaconda"
cask "brave-browser"
cask "font-ia-writer-mono"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "github"
cask "github-copilot-for-xcode"
cask "google-chrome@canary"
cask "imageoptim"
cask "ios-app-signer"
cask "netnewswire"
cask "periphery"
cask "postman"
cask "protonvpn"
cask "proxyman"
cask "qlab"
cask "qladdict"
cask "qlc+"
cask "qlcolorcode"
cask "qlcommonmark"
cask "qldds"
cask "qlprettypatch"
cask "qlstephen"
cask "qlswift"
cask "qlvideo"
cask "qlzipinfo"
cask "rectangle"
cask "syntax-highlight"
cask "visual-studio-code"
cask "warp"
cask "xcodes"
vscode "automatalabs.copilot-mcp"
vscode "castwide.solargraph"
vscode "docker.docker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hbenl.vscode-test-explorer"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mebrahtom.plantumlpreviewer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "saoudrizwan.claude-dev"
vscode "sweetpad.sweetpad"
vscode "t3dotgg.vsc-material-theme-but-i-wont-sue-you"
vscode "vadimcn.vscode-lldb"
vscode "wxpcopilotinc.wxp-copilot"
vscode "xline.agent-lab"
