tap "finestructure/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "opencode-ai/tap"
tap "peripheryapp/periphery"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "binwalk"
brew "carthage"
brew "python@3.13"
brew "choose"
brew "clang-format"
brew "cocoapods"
brew "curl"
brew "detect-secrets"
brew "difftastic"
brew "docker"
brew "dust"
brew "eza"
brew "terminal-notifier"
brew "fastlane"
brew "fd"
brew "fzf"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras", link: false
brew "git-flow"
brew "git-ignore"
brew "git-imerge"
brew "git-lfs"
brew "git-quick-stats"
brew "git-secrets"
brew "git-standup"
brew "gitleaks"
brew "gnupg"
brew "grex"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "ios-deploy"
brew "jq"
brew "kotlin"
brew "lefthook"
brew "libffi"
brew "lsd"
brew "mas"
brew "ncdu"
brew "neovim"
brew "node"
brew "periphery", link: false
brew "pipx"
brew "plantuml"
brew "pre-commit"
brew "procs"
brew "pyenv"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "rcm"
brew "ripgrep"
brew "sd"
brew "shellcheck"
brew "sourcery"
brew "stow"
brew "swift-format"
brew "swiftformat"
brew "swiftlint"
brew "the_silver_searcher"
brew "tldr"
brew "utf8proc", args: ["HEAD"]
brew "tmux"
brew "tokei"
brew "tree"
brew "unzip"
brew "velero"
brew "watchman"
brew "wget"
brew "xcbeautify"
brew "xcinfo"
brew "xcode-build-server"
brew "xcodegen"
brew "xcv"
brew "yarn"
brew "zip"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "finestructure/tap/arena"
brew "opencode-ai/tap/opencode"
cask "anaconda"
cask "appcleaner"
cask "brave-browser"
cask "font-ia-writer-mono"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "github"
cask "github-copilot-for-xcode"
cask "google-chrome@canary"
cask "imageoptim"
cask "ios-app-signer"
cask "netnewswire"
cask "periphery"
cask "postman"
cask "protonvpn"
cask "proxyman"
cask "qlab"
cask "qladdict"
cask "qlc+"
cask "qlcolorcode"
cask "qlcommonmark"
cask "qldds"
cask "qlprettypatch"
cask "qlstephen"
cask "qlswift"
cask "qlvideo"
cask "qlzipinfo"
cask "rectangle"
cask "syntax-highlight"
cask "visual-studio-code"
cask "warp"
cask "xcodes-app"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "coderabbit.coderabbit-vscode"
vscode "danielgtaylor.structured-data-templates"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "furiousturtle.terminal-commander"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "hbenl.vscode-test-explorer"
vscode "hyzeta.vscode-theme-github-light"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "knisterpeter.vscode-github"
vscode "mebrahtom.plantumlpreviewer"
vscode "mhutchie.git-graph"
vscode "moderato-app.xopen"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "openai.chatgpt"
vscode "paragdiwan.gitpatch"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "phil294.git-log--graph"
vscode "pinage404.git-extension-pack"
vscode "redhat.vscode-yaml"
vscode "reduckted.vscode-gitweblinks"
vscode "solomonkinard.git-tabs"
vscode "streetsidesoftware.code-spell-checker"
vscode "sycl.markdown-command-runner"
vscode "t3dotgg.vsc-material-theme-but-i-wont-sue-you"
vscode "timonwong.shellcheck"
vscode "tuxtina.json2yaml"
vscode "usernamehw.errorlens"
vscode "vknabel.vscode-swiftformat"
vscode "vknabel.vscode-swiftlint"
vscode "vstirbu.vscode-mermaid-preview"
