# Taps - Additional repositories
tap "homebrew/bundle"
tap "homebrew/services"

# Development Tools
brew "git"
brew "git-lfs"
brew "swiftlint"
brew "swift-format"
brew "sourcery"
brew "openssl"
brew "libyaml"
brew "libffi"
brew "ack"
brew "wget"
brew "curl"
brew "jq"
brew "tree"
brew "htop"
brew "the_silver_searcher"
brew "tmux"
brew "zsh"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "fd"
brew "ncdu"
brew "tldr"
brew "httpie"
brew "tree"

# Testing Tools
brew "bats-core"  # Bash Automated Testing System
brew "kcov"       # Code coverage for shell scripts

# Git Tools
brew "git-lfs"
brew "git-secrets"
brew "git-extras"  # Includes git-ignore and git-standup
brew "git-flow"
brew "git-imerge"
brew "git-quick-stats"

# iOS Development
brew "cocoapods"
brew "carthage"
brew "fastlane"
brew "xcodegen"
brew "ios-deploy"

# Additional Tools
brew "neovim"
brew "watchman"  # React Native dependency

# Cask Apps (GUI Applications)
cask "xcodes"    # Xcode version manager
cask "postman"   # API testing
cask "visual-studio-code"
cask "fork"
cask "hiddenbar"
